import React, { useState } from 'react';
import styles from './TermsAndConditions.module.css';
import { ArrowDownIcon, ArrowUpIcon } from '../../components/UI/icons';

const TermsAndConditions = () => {
  const [openSections, setOpenSections] = useState({});

  const toggleDropdown = section => {
    setOpenSections(prevState => ({
      ...prevState,
      [section]: !prevState[section],
    }));
  };

  return (
    <div className="mainContainer">
      <div className={styles.container}>
        <div className={styles.rulesTitle}>წესები და პირობები</div>

        <div className={styles.rulesContainer}>
          <div
            className={styles.rulesInnerTitle}
            onClick={() => toggleDropdown('section1')}
          >
            ● ცენზურა უნდა იყოს დაცული
            <span className={styles.arrow}>
              {openSections.section1 ? <ArrowUpIcon /> : <ArrowDownIcon />}
            </span>
          </div>
          {openSections.section1 && (
            <>
              <div className={styles.rulesParagraphTitle}>ცენზურის დაცვა:</div>
              <div>
                ვებ-გვერდი იცავს თავისი მომხმარებლების გამოხატვის თავისუფლებას.
                ჩვენ არ ვაწესებთ ცენზურას პოლიტიკურ ან იდეოლოგიურ შეხედულებებზე
                დაფუძნებულ შინაარსზე, თუ ის არ არღვევს რაიმე კანონს ან ამ
                შეთანხმების პირობებს.
              </div>

              <div className={styles.rulesParagraphTitle}>
                უკანონო შინაარსი:
              </div>
              <div>
                ჩვენ ვეწინააღმდეგებით ყოველი მომხმარებლის ქცევას, რომელიც
                უკანონოა ან რომელიც ხელს უწყობს უკანონო ქმედებებს, როგორებიცაა
                სიძულვილის ენა, ტერორიზმი ან ძალადობის წაქეზება.
              </div>

              <div className={styles.rulesParagraphTitle}>
                სპამი და თაღლითობა:
              </div>
              <div>
                ჩვენ წავშლით კონტენტს, რომელიც არის სპამი ან ხელს უწყობს
                თაღლითობასა ან დეზინფორმაციას.
              </div>

              <div className={styles.rulesParagraphTitle}>
                კონფიდენციალურობა:
              </div>
              <div>
                ჩვენ წავშლით კონტენტს, რომელიც არღვევს სხვების
                კონფიდენციალურობას, როგორიცაა პერსონალური ინფორმაცია, მათი
                გაზიარების თანხმობის გარეშე.
              </div>

              <div className={styles.rulesParagraphTitle}>შევიწროება:</div>
              <div>
                ჩვენ წავშლით კონტენტს, რომელიც ავიწროებს ან ემუქრება სხვებს.
              </div>

              <div className={styles.rulesParagraphTitle}>
                გასაჩივრების პროცესი:
              </div>
              <div>
                თუ კონტენტი წაიშლება, მომხმარებელს, რომელმაც ის გამოაქვეყნა,
                შეუძლია გაასაჩივროს გადაწყვეტილება ვებ-საიტზე მითითებული
                ელ.ფოსტის მეშვეობით. ჩვენ განვიხილავთ აპელაციას და აღვადგენთ
                კონტენტს იმ შემთხვევაში, თუ დადგინდება, რომ ის არ არღვევს საიტის
                წესებს.
              </div>

              <div className={styles.rulesParagraphTitle}>გამჭვირვალობა:</div>
              <div>
                ჩვენ გამჭვირვალე ვიქნებით ჩვენი ცენზურის პოლიტიკისა და შინაარსის
                წაშლის მიზეზებთან დაკავშირებით. ჩვენ გამოვაქვეყნებთ რეგულარულ
                ანგარიშებს კონტენტის წაშლის მოთხოვნის რაოდენობის შესახებ,
                რომელსაც ვიღებთ და იმას, თუ როგორ ვამუშავებთ მათ.
              </div>

              <div className={styles.rulesParagraphTitle}>
                თანამშრომლობა ხელისუფლებასთან:
              </div>
              <div>
                ჩვენ ასევე ვითანამშრომლებთ ხელისუფლებასთან, როდესაც მივიღებთ
                კანონიერ მოთხოვნას კონტენტის წაშლის შესახებ. თუმცა, ჩვენ
                გავამჟღავნებთ მომხმარებლის მონაცემებს მხოლოდ ჩვენი
                კონფიდენციალურობის პოლიტიკის შესაბამისად და გავასაჩივრებთ
                მოთხოვნებს, რომლებიც, ჩვენი აზრით, გაუმართლებელია ან
                კანონსაწინააღმდეგოა.
              </div>

              <div>
                ვებგვერდის გამოყენებით თქვენ ეთანხმებით ცენზურის დაცვის წესებს.
                ჩვენ ვიტოვებთ უფლებას გავაახლოთ ეს წესები ნებისმიერ დროს და
                შევატყობინოთ მომხმარებლებს ნებისმიერი ცვლილების შესახებ.
              </div>
            </>
          )}
        </div>

        <div className={styles.rulesContainer}>
          <div
            className={styles.rulesInnerTitle}
            onClick={() => toggleDropdown('section2')}
          >
            ● კურსის ატვირთვის წესები პირობები
            <span className={styles.arrow}>
              {openSections.section2 ? <ArrowUpIcon /> : <ArrowDownIcon />}
            </span>
          </div>

          {openSections.section2 && (
            <>
              <div className={styles.rulesParagraphTitle}>კურსის შინაარსი:</div>
              <div>
                მომხმარებლებს უფლება აქვთ ატვირთონ ვიდეო კურსები ვებ-საიტზე.
                კურსები უნდა იყოს მომხმარებლის მიერ შექმნილი, ორიგინალური
                შინაარსის და არ უნდა შეიცავდეს საავტორო უფლებებით დაცულ ან
                საკუთრებაში არსებულ მასალას მფლობელის პირდაპირი ნებართვის
                გარეშე.
              </div>

              <div className={styles.rulesParagraphTitle}>
                ხარისხის სტანდარტები :
              </div>
              <div>
                კურსები უნდა იყოს მაღალი ხარისხის და მიაწოდოს ღირებული
                ინფორმაცია მომხმარებლებს. ისინი უნდა იყოს კარგად
                სტრუქტურირებული, ადვილად შესასრულებელი და შეიცავდეს შესაბამის და
                განახლებულ ინფორმაციას.
              </div>

              <div className={styles.rulesParagraphTitle}>ფაილის ფორმატი:</div>
              <div>
                კურსები უნდა აიტვირთოს სტანდარტული ვიდეო ფაილის ფორმატში (მაგ.
                MP4, AVI და ა.შ.) და უნდა იყოს ოპტიმიზირებული ონლაინ
                სტრიმინგისთვის.
              </div>

              <div className={styles.rulesParagraphTitle}>კურსის აღწერა:</div>
              <div>
                მომხმარებლებმა უნდა წარმოადგინონ კურსის მკაფიო და ზუსტი აღწერა,
                მათ შორის კურსის სახელწოდება, სამიზნე აუდიტორია და სასწავლო
                მიზნები.
              </div>

              <div className={styles.rulesParagraphTitle}>საავტორო უფლება:</div>
              <div>
                მომხმარებლები ინარჩუნებენ საავტორო უფლებებს თავიანთ კურსებზე,
                მაგრამ ანიჭებენ ვებ-საიტს კურსის მასპინძლობისა და გავრცელების
                ლიცენზიას. კურსის ატვირთვით თქვენ აცხადებთ და იძლევით გარანტიას,
                რომ გაქვთ ამ ლიცენზიის გაცემის უფლება და რომ კურსი არ არღვევს
                მესამე მხარის ინტელექტუალურ საკუთრების უფლებებს.
              </div>

              <div className={styles.rulesParagraphTitle}>ანაზღაურება:</div>
              <div>
                მომხმარებლებს შეუძლიათ აირჩიონ თავიანთი კურსების შეთავაზება
                უფასოდ ან ფასიანად. თუ შემოთავაზებული კურსი ფასიანია,
                ინსტრუქტორი მიიღებს პროცენტს კურსის გაყიდვიდან მიღებული
                შემოსავლიდან ან საიტი შეიძენს მის კურსს სრულიად და შემდეგ
                განთავსდება ვებ გვერდზე.
              </div>

              <div className={styles.rulesParagraphTitle}>
                განხილვის პროცესი:
              </div>
              <div>
                ყველა კურსი განიხილება საიტის გუნდის მიერ, სანამ ისინი
                ხელმისაწვდომი გახდება საზოგადოებისთვის. განხილვის პროცესს
                შეიძლება 2 სამუშაო დღე დასჭირდეს.
              </div>

              <div className={styles.rulesParagraphTitle}>კურსების მოხსნა:</div>
              <div>
                ვებსაიტი იტოვებს უფლებას წაშალოს კურსები, რომლებიც არღვევენ ამ
                წესებს ან მიჩნეულია, რომ უხარისხოა ან არ შეესაბამება ვებსაიტის
                მისიასა და ღირებულებებს.
              </div>

              <div>
                ვებსაიტზე კურსის ატვირთვით თქვენ ეთანხმებით ამ წესებსა და
                პირობებს. ჩვენ ვიტოვებთ უფლებას გავაახლოთ ეს წესები ნებისმიერ
                დროს და შევატყობინოთ მომხმარებლებს ნებისმიერი ცვლილების შესახებ.
              </div>
            </>
          )}
        </div>

        <div className={styles.rulesContainer}>
          <div
            className={styles.rulesInnerTitle}
            onClick={() => toggleDropdown('section3')}
          >
            ● კურსის ყიდვის წესები პირობები
            <span className={styles.arrow}>
              {openSections.section3 ? <ArrowUpIcon /> : <ArrowDownIcon />}
            </span>
          </div>

          {openSections.section3 && (
            <>
              <div className={styles.rulesParagraphTitle}>კურსების შეძენა:</div>
              <div>
                მომხმარებლებს შეუძლიათ შეიძინონ კურსები ვებსაიტზე გადახდის
                სხვადასხვა მეთოდის გამოყენებით. კურსის შეძენით თქვენ აცხადებთ
                თანხმობას გადაიხადოთ კურსისთვის მითითებული ფასი.
              </div>

              <div className={styles.rulesParagraphTitle}>
                თანხის დაბრუნების პოლიტიკა:
              </div>
              <div>
                თუ მომხმარებელი არ არის კმაყოფილი კურსით, მას შეუძლია მოითხოვოს
                თანხის დაბრუნება შეძენიდან 7 დღის განმავლობაში. თანხის დაბრუნება
                გაიცემა გადახდის ორიგინალური ფორმით.
              </div>

              <div className={styles.rulesParagraphTitle}>
                შეძენილ კურსებზე წვდომა:
              </div>
              <div>
                კურსის შეძენისას მომხმარებლებს ექნებათ წვდომა კურსზე შეძენის
                დღიდან 1 წლის განმავლობაში. 1 წლიანი პერიოდის შემდეგ კურსის
                შინაარსზე წვდომა იწურება და ის მომხმარებლისთვის ხელმისაწვდომი
                აღარ იქნება.
              </div>

              <div className={styles.rulesParagraphTitle}>
                კურსის განახლებები:
              </div>
              <div>
                კურსები შეიძლება დროდადრო განახლდეს. მომხმარებლებს, რომლებმაც
                შეიძინეს კურსი, უფასოდ ექნებათ წვდომა განახლებულ ვერსიაზე.
              </div>

              <div className={styles.rulesParagraphTitle}>
                კურსების გაზიარება და განაწილება:
              </div>
              <div>
                მომხმარებლებს არ აქვთ უფლება გააზიარონ ან გაავრცელონ კურსის
                შინაარსი მესამე მხარისთვის. კურსის შინაარსი განკუთვნილია მხოლოდ
                პირადი გამოყენებისთვის.
              </div>

              <div className={styles.rulesParagraphTitle}>საავტორო უფლება:</div>
              <div>
                კურსის შინაარსის საავტორო უფლება ეკუთვნის კურსის შემქმნელს.
                კურსის შეძენით, თქვენ გეძლევათ ლიცენზია, რომ მიიღოთ და ნახოთ
                კურსის შინაარსი მხოლოდ პირადი სარგებლობისთვის.
              </div>

              <div className={styles.rulesParagraphTitle}>პასუხისმგებლობა:</div>
              <div>
                ვებგვერდი არ არის პასუხისმგებელი კურსის შინაარსის შეძენის ან
                გამოყენების შედეგად წარმოქმნილ ზარალზე.
              </div>

              <div>
                ვებსაიტზე კურსის შეძენით თქვენ ეთანხმებით ამ წესებსა და
                პირობებს. ჩვენ ვიტოვებთ უფლებას განვაახლოთ ეს პირობები ნებისმიერ
                დროს და შევატყობინოთ მომხმარებლებს ნებისმიერი ცვლილების შესახებ.
              </div>
            </>
          )}
        </div>

        <div className={styles.rulesContainer}>
          <div
            className={styles.rulesInnerTitle}
            onClick={() => toggleDropdown('section4')}
          >
            ● გადახდის წესები და პირობები
            <span className={styles.arrow}>
              {openSections.section4 ? <ArrowUpIcon /> : <ArrowDownIcon />}
            </span>
          </div>

          {openSections.section4 && (
            <>
              <div className={styles.rulesParagraphTitle}>
                გადახდის მეთოდები:
              </div>
              <div>
                ვებსაიტი იღებს გადახდის სხვადასხვა მეთოდს, მათ შორის
                საკრედიტო/სადებეტო ბარათებს და ონლაინ გადახდის სისტემებს.
                მიღებული გადახდის კონკრეტული მეთოდები ჩამოთვლილი იქნება
                ვებგვერდზე.
              </div>

              <div className={styles.rulesParagraphTitle}>
                გადახდის დამუშავება:
              </div>
              <div>
                ყველა გადახდა მუშავდება ჩვენი, მესამე მხარის გადახდის პროცესორის
                მიერ. გადახდის განხორციელებით თქვენ ეთანხმებით გადახდის
                პროცესორის პირობებს.
              </div>

              <div className={styles.rulesParagraphTitle}>
                თანხის დაბრუნება:
              </div>
              <div>
                თანხის დაბრუნება მოხდება ჩვენი თანხის დაბრუნების პოლიტიკის
                შესაბამისად, როგორც ეს მოცემულია კურსის შესყიდვის წესებსა და
                პირობებში.
              </div>

              <div className={styles.rulesParagraphTitle}>ბილინგი:</div>
              <div>
                თუ თქვენ ყიდულობთ გამოწერას ან კურსს განმეორებით, თქვენ
                დაგერიცხებათ ბილინგი განმეორებით, თქვენ მიერ არჩეული გამოწერის
                ან კურსის პაკეტის შესაბამისად.
              </div>

              <div className={styles.rulesParagraphTitle}>
                ფასების ცვლილებები:
              </div>
              <div>
                კურსების და გამოწერების ფასები შეიძლება ნებისმიერ დროს
                შეიცვალოს. ჩვენ შეგატყობინებთ ნებისმიერი ფასის ცვლილების
                შესახებ, სანამ ისინი ძალაში შევა.
              </div>

              <div className={styles.rulesParagraphTitle}>ვალუტა:</div>
              <div>
                ყველა ფასი მოცემულია ლარში, თუ სხვა რამ არ არის მითითებული.
              </div>

              <div className={styles.rulesParagraphTitle}>
                გაყიდვების საგადასახადო:
              </div>
              <div>
                გაყიდვების გადასახადი დაემატება კურსის ან გამოწერის ფასს, სადაც
                ეს შესაძლებელია.
              </div>

              <div className={styles.rulesParagraphTitle}>დავები:</div>
              <div>
                თუ თქვენ გაქვთ დავა თქვენს ანგარიშზე გადასახდელთან დაკავშირებით,
                დაუყოვნებლივ უნდა დაგვიკავშირდეთ. თუ ჩვენ ვერ მოვახერხეთ დავის
                გადაჭრა, თქვენ შეგეძლებათ დავის განხილვა თქვენს ბანკთან ან
                საკრედიტო ბარათის კომპანიასთან.
              </div>

              <div>
                ვებგვერდზე გადახდის განხორციელებით თქვენ ეთანხმებით ამ გადახდის
                წესებსა და პირობებს. ჩვენ ვიტოვებთ უფლებას განვაახლოთ ეს
                პირობები ნებისმიერ დროს და შეატყობინებთ მომხმარებლებს ნებისმიერი
                ცვლილების შესახებ.
              </div>
            </>
          )}
        </div>

        <div className={styles.rulesContainer}>
          <div
            className={styles.rulesInnerTitle}
            onClick={() => toggleDropdown('section5')}
          >
            ● პაროლის შეცვლის აღდგენის პირობები ასევე სახელის გადაკეთების და
            პირადი გვერდის შეცვლის წესები
            <span className={styles.arrow}>
              {openSections.section5 ? <ArrowUpIcon /> : <ArrowDownIcon />}
            </span>
          </div>

          {openSections.section5 && (
            <>
              <div className={styles.rulesParagraphTitle}>
                პაროლის აღდგენა:{' '}
              </div>
              <div>
                მომხმარებლებს შეუძლიათ პაროლის აღდგენა მათ ანგარიშთან
                დაკავშირებული ელფოსტის მიწოდებით და ამ ელფოსტის მისამართზე
                გაგზავნილი პაროლის აღდგენის ელ. ფოსტის ინსტრუქციების მითითებით.
              </div>

              <div className={styles.rulesParagraphTitle}>
                პირადი გვერდის გადაკეთება და შეცვლა:
              </div>
              <div>
                მომხმარებლებს შეუძლიათ შეცვალონ და გადააკეთონ თავიანთი
                პერსონალური გვერდი მათ ანგარიშში და პარამეტრების განყოფილებაში
                შესვლით. პირად გვერდზე შეტანილი ცვლილებები ავტომატურად
                შეინახება.
              </div>

              <div className={styles.rulesParagraphTitle}>სახელის შეცვლა:</div>
              <div>
                მომხმარებლებს შეუძლიათ შეცვალონ სახელი ვებსაიტზე მათ ანგარიშში
                და პარამეტრების განყოფილებაში შესვლით. მათ უნდა წარმოადგინონ
                მოქმედი პირადობის მოწმობა, როგორც პირადობის დამადასტურებელი
                საბუთი, ცვლილების განხორციელებამდე.
              </div>

              <div className={styles.rulesParagraphTitle}>პროფილის სურათი:</div>
              <div>
                მომხმარებლებს შეუძლიათ შეცვალონ პროფილის სურათი საკუთარ
                ანგარიშში და პარამეტრების განყოფილებაში შესვლით. მათ უნდა
                უზრუნველყონ, რომ სურათი შეესაბამოს მომსახურების პირობებს, მათ
                შორის, არ შეიცავდეს რაიმე შეურაცხმყოფელ შინაარსს.
              </div>

              <div className={styles.rulesParagraphTitle}>
                მომხმარებლის პასუხისმგებლობა:
              </div>
              <div>
                მომხმარებლები პასუხისმგებელნი არიან თავიანთი ანგარიშისა და
                პაროლის უსაფრთხოებაზე. თუ მომხმარებელი ეჭვობს, რომ მისი ანგარიში
                გატეხილია, მან დაუყოვნებლივ უნდა შეცვალოს პაროლი და დაუკავშირდეს
                ვებსაიტს.
              </div>

              <div>
                ვებგვერდის გამოყენებით თქვენ ეთანხმებით ამ წესებსა და პირობებს.
                ჩვენ ვიტოვებთ უფლებას განვაახლოთ ეს პირობები ნებისმიერ დროს და
                შეატყობინებთ მომხმარებლებს ნებისმიერი ცვლილების შესახებ.
              </div>
            </>
          )}
        </div>

        <div className={styles.rulesContainer}>
          <div
            className={styles.rulesInnerTitle}
            onClick={() => toggleDropdown('section6')}
          >
            ● ზოგადი წესები და პირობები
            <span className={styles.arrow}>
              {openSections.section6 ? <ArrowUpIcon /> : <ArrowDownIcon />}
            </span>
          </div>

          {openSections.section6 && (
            <>
              <div className={styles.rulesParagraphTitle}>შინაარსი:</div>
              <div>
                საიტი საშუალებას აძლევს მომხმარებლებს გაუზიარონ თავიანთი ცოდნა
                და შეხედულებები სხვადასხვა თემებზე. ჩვენ არ ვაკონტროლებთ და არ
                ვადასტურებთ მომხმარებლის მიერ გაზიარებულ კონტენტს და ვერ
                ვიძლევით გარანტიას მის სიზუსტეს, სისრულესა და ხარისხს.
                ვებგვერდის გამოყენებით თქვენ ეთანხმებით, რომ არ გააზიაროთ
                არალეგალური, პორნოგრაფიული, ცილისმწამებლური, დისკრიმინაციული ან
                სხვაგვარად შეურაცხმყოფელი შინაარსი. ჩვენ ვიტოვებთ უფლებას
                წავშალოთ ნებისმიერი კონტენტი, რომელიც არღვევს ამ პირობებს.
              </div>

              <div className={styles.rulesParagraphTitle}>საავტორო უფლება:</div>
              <div>
                ვებსაიტის შინაარსი, მათ შორის, მაგრამ არ შემოიფარგლება ტექსტით,
                გრაფიკით, ლოგოებით, სურათებით და პროგრამული უზრუნველყოფით,
                დაცულია საავტორო უფლებებით და ინტელექტუალური საკუთრების სხვა
                კანონებით. თქვენ არ შეგიძლიათ რეპროდუცირება, გავრცელება ან
                სხვაგვარად გამოყენება ვებსაიტის ნებისმიერი შინაარსის ჩვენი
                პირდაპირი ნებართვის გარეშე.
              </div>

              <div className={styles.rulesParagraphTitle}>პასუხისმგებლობა:</div>
              <div>
                ვებსაიტი და მისი შინაარსი მოწოდებულია "როგორც არის" და "როგორც
                ხელმისაწვდომია". ჩვენ არ ვაძლევთ რაიმე სახის წარმოდგენას ან
                გარანტიას, გამოხატულს ან ნაგულისხმევს, ვებსაიტის ფუნქციონირების
                ან ვებსაიტზე შეტანილი ინფორმაციის, შინაარსის, მასალების ან
                პროდუქტების შესახებ.
              </div>

              <div className={styles.rulesParagraphTitle}>
                ცვლილებები პირობებში:
              </div>
              <div>
                ჩვენ ვიტოვებთ უფლებას გავაახლოთ და შევცვალოთ წინამდებარე
                ხელშეკრულების პირობები ნებისმიერ დროს. თქვენ მიერ ვებსაიტის
                განგრძობით გამოყენება ამ ხელშეკრულებაში შეტანილი ნებისმიერი
                ცვლილების შემდეგ წარმოადგენს თქვენ მიერ ამ ცვლილებების მიღებას.
              </div>

              <div className={styles.rulesParagraphTitle}>მოქმედი კანონი:</div>
              <div>
                ეს შეთანხმება და ნებისმიერი დავა, რომელიც წარმოიქმნება ან
                დაკავშირებულია მასზე ან ვებსაიტზე, რეგულირდება და განიმარტება იმ
                იურისდიქციის კანონმდებლობის შესაბამისად, სადაც დაფუძნებულია
                ვებსაიტი, კანონის რაიმე კონფლიქტის დებულებების მოქმედების
                გარეშე.
              </div>

              <div>
                ვებგვერდის გამოყენებით, თქვენ ეთანხმებით, რომ ვალდებულნი ხართ
                დაიცვან წინამდებარე წესები და პირობები. თუ არ ეთანხმებით
                რომელიმე ამ პირობებს, გეკრძალებათ ამ საიტის გამოყენება ან
                წვდომა.
              </div>

              <div className={styles.rulesParagraphTitle}>
                ანგარიშის რეგისტრაცია:
              </div>
              <div>
                ვებსაიტის გარკვეული ფუნქციების გამოსაყენებლად, თქვენ უნდა
                დარეგისტრირდეთ ანგარიშზე. თქვენ ხართ პასუხისმგებელი თქვენი
                ანგარიშისა და პაროლის კონფიდენციალურობის შენარჩუნებაზე და თქვენს
                კომპიუტერზე წვდომის შეზღუდვაზე და თანახმა ხართ მიიღოთ
                პასუხისმგებლობა ყველა აქტივობაზე, რომელიც ხდება თქვენი ანგარიშის
                ან პაროლის ქვეშ.
              </div>

              <div className={styles.rulesParagraphTitle}>
                გადახდა და გამოწერა:
              </div>
              <div>
                ვებსაიტის ზოგიერთმა ფუნქციამ შეიძლება მოითხოვოს გადახდა ან
                გამოწერა. ამ ფუნქციების გადახდით ან გამოწერით, თქვენ ეთანხმებით
                გადახდის ან გამოწერის პირობებს, მათ შორის განმეორებადი
                გადასახადების ჩათვლით.
              </div>

              <div className={styles.rulesParagraphTitle}>
                აკრძალული საქმიანობა:
              </div>
              <div>
                თქვენ არ შეგიძლიათ გამოიყენოთ ვებგვერდი რაიმე უკანონო ან
                არაავტორიზებული მიზნებისთვის. თქვენ არ უნდა დაარღვიოთ ვებსაიტის
                გამოყენებისას თქვენი იურისდიქციის ნებისმიერი კანონი (მათ შორის,
                მაგრამ არ შემოიფარგლება საავტორო უფლებების შესახებ კანონებით).
              </div>

              <div className={styles.rulesParagraphTitle}>
                მომხმარებლის გენერირებული შინაარსი:
              </div>
              <div>
                მომხმარებლებს შეუძლიათ წარმოადგინონ შინაარსი ვებსაიტზე, მათ
                შორის, მაგრამ არ შემოიფარგლება მხოლოდ ტექსტით, სურათებით,
                ვიდეოებით და აუდიოებით. შინაარსის გაგზავნით, თქვენ გვაძლევთ
                არაექსკლუზიურ, მსოფლიო მასშტაბით, ჰონორარის გარეშე,
                ქველიცენზირებადი და გადაცემის ლიცენზიას ვებსაიტთან და ჩვენს
                ბიზნესთან დაკავშირებით შინაარსის გამოყენების, რეპროდუცირების,
                გავრცელების, წარმოებული სამუშაოების მომზადების, ჩვენების და
                შესრულებისთვის.
              </div>

              <div className={styles.rulesParagraphTitle}>ანაზღაურება:</div>
              <div>
                თქვენ თანახმა ხართ აანაზღაუროთ და დატოვოთ ვებსაიტი და მისი
                შვილობილი პირები, ოფიცრები, აგენტები და თანამშრომლები ნებისმიერი
                პრეტენზიისა თუ მოთხოვნისაგან, მათ შორის გონივრული ადვოკატის
                საფასურისგან, რომელიც წამოყენებულია ნებისმიერი მესამე მხარის
                მიერ თქვენი ვებსაიტის გამოყენების, თქვენი დარღვევის გამო ან
                შედეგად გამოწვეული. ამ შეთანხმების, ან თქვენ მიერ სხვისი
                უფლებების დარღვევა.
              </div>

              <div className={styles.rulesParagraphTitle}>შეწყვეტა:</div>
              <div>
                ჩვენ ვიტოვებთ უფლებას შეწყვიტოთ თქვენი ვებგვერდის გამოყენება
                ნებისმიერ დროს, გაფრთხილების გარეშე, რაიმე მიზეზით, მათ შორის
                შეზღუდვის გარეშე, ამ შეთანხმების დარღვევით.
              </div>

              <div className={styles.rulesParagraphTitle}>
                გარანტიების უარყოფა:
              </div>
              <div>
                ვებსაიტი მოწოდებულია „როგორც არის“ და „როგორც ხელმისაწვდომია“
                საფუძველზე. ჩვენ არ ვიძლევით გარანტიას, რომ ვებსაიტი იქნება
                უწყვეტი ან შეცდომების გარეშე. ვებგვერდის საშუალებით
                ხელმისაწვდომი სიახლეების, ინფორმაციის ან სხვა მასალების შეიძლება
                იყოს შეფერხებები, გამოტოვებები, შეფერხებები და უზუსტობები.
              </div>

              <div className={styles.rulesParagraphTitle}>
                Საკონტაქტო ინფორმაცია:
              </div>
              <div>
                თუ თქვენ გაქვთ რაიმე შეკითხვები წინამდებარე ხელშეკრულების ან
                ვებსაიტის შესახებ, გთხოვთ დაგვიკავშირდეთ ვებსაიტზე მითითებულ
                ელფოსტის მისამართზე.
              </div>
            </>
          )}
        </div>
      </div>
    </div>
  );
};

export default TermsAndConditions;
